//
//  DataManager.swift
//  HealthyApp
//
//  Created by Александр Касьянов on 26.03.2022.
//

class DataManager {
    
    static let shared = DataManager()
    
    let names = [
    "Вилена", "Милена", "Арина", "Дарина",
    "Анастасия", "Елена", "Ольга", "Белослава",
    "Агриппина", "Агафья"
    ]
    
    let surnames = [
        "Головатюкова", "Кусайкова", "Пилипончикова",
        "Бубенцова","Ржевская", "Голомудько",
        "Убейконь", "Вислоушкина",
        "Тараканчикова", "Лялькина"
    ]
    
    private init() {}
}
