//
//  Dish.swift
//  HealthyApp
//
//  Created by Александр Касьянов on 30.03.2022.
//

import Foundation

struct Dish {
    let title: String
    let ingridients: [String]
    
    static func getDish() -> [Dish] {
        [
            Dish(title: "Индейка томлённая в кокосовом молоке",
                 ingridients: ["Индейка грудка", "Перец чили", "Грибы шампиньоны",
                               "Рис жасминовый", "Молоко кокосовое", "Соус рыбный",
                               "Лук", "Кинза", "Масло кокосовое"]),
            Dish(title: "Салат Сокровища нации",
                 ingridients: ["Тыква", "Сок лайма", "Набор мексиканских специй",
                               "Креветки тигровые", "Красный киноа", "Свежая зелень",
                               "Перец чили", "", ""]),
            Dish(title: "Стейки лосося с хумусом из печеной моркови",
                 ingridients: ["Семечки подсолнуха", "Масло апельсиновое",
                               "Лосось филе", "Чеснок", "Чипсы начос", "Морковь",
                               "Соус соевый", "Свежая зелень", "Кунжут белый",
                               "Сыр рикотта", "Оливки", "Паста мисо"]),
            Dish(title: "Веганский суп с грибами шиитаке",
                 ingridients: ["Паприка", "Тофу шёлковый", "Масло кунжутное",
                               "Морковь", "Имбирь", "Имбирь", "Картофель",
                               "Свежая зелень", "Паприка копчёная", "Кунжут белый",
                               "Водоросли нори", "Соус соевый"]),
            Dish(title: "Суп-пюре из тыквы с курицей тандури",
                 ingridients: ["Курица грудка", "Тыква", "Приправа Тандури",
                               "Томаты в собственном соку", "Свежая зелень",
                               "Лук порей", "Сок лайма", "Сок лайма", "Соус рыбный",
                              "Куриный бульон"]),
            Dish(title: "Чечевица с запечённым фенхелем",
                 ingridients: ["Смесь специй Заатар", "Фенхель", "Вяленые томаты",
                               "Морковь", "Чечевица", "Петрушка", "Тыквенное масло",
                               "Лук"]),
            Dish(title: "Запечёный судак в панировке из пармезана",
                 ingridients: ["Острая паприка", "Паприка", "Соус песто",
                               "Капуста цветная", "Свежая зелень", "Зеленый горошек",
                               "Пармезан", "Филе судака"]),
            Dish(title: "Рагу по-мексикански с киноа и красной фасолью",
                 ingridients: ["Томаты в собственном соку", "Киноа", "Лук",
                               "Корица", "Болгарский перец", "Кинза",
                               "Морковь", "Чеснок", "Смесь специй Заатар", "Фасоль"])
        ]
    }
    
}
